---
type: ViewNavigationToolSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ViewNavigationToolSettings

`Autodesk.Revit.DB.ViewNavigationToolSettings` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetHomeCamera | 2016 | `public HomeCamera GetHomeCamera ()` |
| Method | GetViewNavigationToolSettings | 2016 | `public static ViewNavigationToolSettings GetViewNavigationToolSettings ( Document pADoc )` |
| Method | IsHomeCameraSet | 2016 | `public bool IsHomeCameraSet ()` |
| Property | Parameter | — | `` |